tap 'homebrew/bundle'
tap 'sanemat/font'

brew 'autojump'
brew 'byobu'
brew 'git'
brew 'git-flow'
brew 'git-lfs'
brew 'go'
brew 'direnv'
brew 'dnsmasq'
brew 'editorconfig'
brew 'htop-osx'
brew 'markdown'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'pandoc'
brew 'postgresql'
brew 'r'
brew 'ruby-build'
brew 'rbenv'
brew 'ssh-copy-id'
brew 'sqlite'
brew 'the_silver_searcher'
brew 'tig'
brew 'trash'
brew 'zsh'
brew 'zsh-completions'

brew 'sanemat/font/ricty'

cask 'chef/chef/chefdk'
cask 'emacs'
cask 'google-chrome'
cask 'iterm2'
