### tap

tap 'sanemat/font'


### main

brew 'autojump'
brew 'byobu'
brew 'coreutils' # for `ls` command
brew 'fswatch'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'htop'
brew 'lsyncd'
# brew 'mysql'
# brew 'nginx'
# brew 'pandoc'
# brew 'postgresql'
brew 'mise'
brew 'ripgrep'
brew 'rsync'
brew 'starship'
brew 'the_silver_searcher'
brew 'tig'
brew 'trash'
brew 'tree'
brew 'zsh-completions'

#### for emacs vterm
brew 'cmake'
brew 'libtool'
brew 'libvterm'

### programming language

brew 'clang-format'
brew 'go'
brew 'node'
# brew 'r'
brew 'ruby-build'
# brew 'rbenv'

#### markdown
brew 'comrak'  # https://github.com/kivikakk/comrak
brew 'markdown'

#### python
# brew 'pyenv'
brew 'uv'
brew 'pipx'


### font

# brew 'sanemat/font/ricty'
cask 'font-hackgen'
cask 'font-hackgen-nerd'
cask 'font-plemol-jp-nf'
cask 'font-udev-gothic-nf'

### cask

# cask 'chef/chef/chefdk'
cask 'aqua-voice'
cask 'balenaetcher'
cask 'chatgpt'
cask 'claude-code'
cask 'codex'
cask 'devtunnel'
cask 'docker-desktop'
cask 'discord'
cask 'emacs-app'
cask 'firefox'
cask 'gcloud-cli'
cask 'ghostty'
cask 'google-chrome'
cask 'google-drive'
cask 'karabiner-elements'
cask 'microsoft-teams'
cask 'netron'
cask 'obsidian'
cask 'sequel-ace'
cask 'slack'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'
